## Лабораторная работа № 1 
### Вариант 1

&nbsp;   
## Условие:  
Дядя Валера собрался открыть IT компанию. Он решил, что все программы в его компании должны быть самыми надежными и быстрыми. Так как у дяди Валеры на компьютере установлен MS-DOS, он решил, что разработка будет вестись именно под эту операционную систему. В качестве языка программирования дядя Валера конечно же выбрал ассемблер (Turbo Assembler).
К сожалению, у дяди Валеры возникли проблемы с наймом сотрудников, а разрабатывать программы уже нужно, поэтому он решил обратиться к вам за помощью.
Помогите дяде Валере реализовать следующую программу:

_if (a > b) and (c < d):  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;print((a - b) * c + d)  
else:    
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;if ((d + a) > (b - c)) or (a == b):  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;print((d + a) - (b - c))  
&nbsp;&nbsp;&nbsp;&nbsp;else:  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;print(b * a - c * d + 4)_  

__Входные данные__

В первой строке задано число a. Во второй строке задано число b. В третьей строке задано число c. В четвертой строке задано число d.

_-100 <= a, b, c, d <= 100_


__Выходные данные__

Выведите единственное целое число - результат вывода программы. Гарантируется, что результат находится в пределах [-30000; 30000].

&nbsp;    

### __!important__: новое решение, прошедшее все тесты в файле `main_remastered.asm` (в котором заодно структура программы и кодстайл более адекватные)

&nbsp;  
###### © 2021, October (Fixed for Contest system in December) | All Rights Reserved
